In [2]:
import numpy as np
import pandas as pd

# <span style="color:blue"> Colume Selection, addition and Deletion </span>

## <span style="color:Yellow"> Create DataFrame</span>

In [11]:
np_array = np.arange(12).reshape(3,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11

In [10]:
df.dtypes

colume1    int64
colume2    int64
colume3    int64
colume4    int64
dtype: object

## <span style="color:Yellow"> Select Single Columns</span>

In [19]:
column_series = df['column3']
column_series

0     2
1     6
2    10
Name: column3, dtype: int64

In [20]:
type(column_series)

pandas.core.series.Series

## <span style="color:Yellow"> Select Multiple Columns</span>

In [24]:
column_list = ['column2','column4']
selected_columns_df = df[column_list]

In [27]:
# Returns the datatype of each column
selected_columns_df.dtypes

column2    int64
column4    int64
dtype: object

In [28]:
# Object type of the return value
type(selected_columns_df)

pandas.core.frame.DataFrame

## <span style="color:Yellow"> Add  a new column </span>

#### <span style="color:red"> Example 1 : add a new column by multiply by 2 of column2</span>

In [37]:
np_array = np.arange(12).reshape(3,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11

In [38]:
df['column5'] = df['column2']*2.0

In [39]:
df

   column1  column2  column3  column4  column5
0        0        1        2        3      2.0
1        4        5        6        7     10.0
2        8        9       10       11     18.0

In [40]:
df.dtypes

column1      int64
column2      int64
column3      int64
column4      int64
column5    float64
dtype: object

#### <span style="color:red"> Example 2 : add a flag column if column5 value is greater than 5 </span>

In [35]:
df["flag"] = df["column5"] > 5

In [36]:
df

   column1  column2  column3  column4  column5   flag
0        0        1        2        3      2.0  False
1        4        5        6        7     10.0   True
2        8        9       10       11     18.0   True

#### <span style="color:red"> Example 3 : add a new column with different index </span>

In [80]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

In [81]:
col4_series = df['column4']
col4_series.index = [0,'row2','row3',3,4]
col4_series

0        3
row2     7
row3    11
3       15
4       19
Name: column4, dtype: int64

In [82]:
df["column5"] = col4_series

In [85]:
df

   column1  column2  column3  column4  column5
0        0        1        2        3      3.0
1        4        5        6        7      NaN
2        8        9       10       11      NaN
3       12       13       14       15     15.0
4       16       17       18       19     19.0

In [86]:
df.dtypes

column1      int64
column2      int64
column3      int64
column4      int64
column5    float64
dtype: object

#### <span style="color:red"> Example 4 : Using Insert Function </span>

In [157]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

In [158]:
new_series = np.arange(5)
new_series
# df.insert(1, "bar", df["one"])

array([0, 1, 2, 3, 4])

In [159]:
new_series = [0, 1, 2, 3, 4]

In [160]:
df.insert(1, "new_column", new_series)

In [154]:
df

   column1  new_column  column2  column3  column4
0        0           0        1        2        3
1        4           1        5        6        7
2        8           2        9       10       11
3       12           3       13       14       15
4       16           4       17       18       19

#### <span style="color:red"> Example 5 : Using assign Method : Normal usage </span>

In [161]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

In [169]:
new_df = df.assign(new_column_2 = df['column4']*2)

   column1  column2  column3  column4  new_column_2
0        0        1        2        3             6
1        4        5        6        7            14
2        8        9       10       11            22
3       12       13       14       15            30
4       16       17       18       19            38

In [170]:
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

#### <span style="color:red"> Example 6 : Using assign Method : as function one column </span>

In [176]:
new_df_2 = df.assign(new_column=lambda x: (x["column2"]*3))
new_df_2

   column1  column2  column3  column4  new_column
0        0        1        2        3           3
1        4        5        6        7          15
2        8        9       10       11          27
3       12       13       14       15          39
4       16       17       18       19          51

#### <span style="color:red"> Example 6 : Using assign Method : as function multiple columns </span>

In [179]:
new_df_3 = df.assign(
    new_column=lambda x: (x["column2"]*3),
    new_column_2=lambda x: (x["new_column"] + x["column4"])
)
new_df_3

   column1  column2  column3  column4  new_column  new_column_2
0        0        1        2        3           3             6
1        4        5        6        7          15            22
2        8        9       10       11          27            38
3       12       13       14       15          39            54
4       16       17       18       19          51            70

## <span style="color:Yellow"> Delete Column </span>

In [132]:
np_array = np.arange(20).reshape(5,4)
df = pd.DataFrame(np_array,columns=['column1','column2','column3','column4'])
df

   column1  column2  column3  column4
0        0        1        2        3
1        4        5        6        7
2        8        9       10       11
3       12       13       14       15
4       16       17       18       19

#### <span style="color:red"> Example 1 : Delete by keyword </span>

In [133]:
del df['column4']

In [134]:
df

   column1  column2  column3
0        0        1        2
1        4        5        6
2        8        9       10
3       12       13       14
4       16       17       18

In [135]:
# del df['column1']

#### <span style="color:red"> Example 2 : Delete by Pop() </span>

In [136]:
column3_sereis = df.pop('column3')

In [137]:
column3_sereis

0     2
1     6
2    10
3    14
4    18
Name: column3, dtype: int64

In [138]:
df

   column1  column2
0        0        1
1        4        5
2        8        9
3       12       13
4       16       17